Revit 2027 API
Wall.StructuralUsage Property
 Retrieves or changes the wall's designated structural usage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralWallUsage StructuralUsage { get; set; }
Public Property StructuralUsage As StructuralWallUsage
	Get
	Set
public:
property StructuralWallUsage StructuralUsage {
	StructuralWallUsage get ();
	void set (StructuralWallUsage value);
}
member StructuralUsage : StructuralWallUsage with get, set
Property Value
StructuralWallUsage
 The wall's designated structural usage, such as bearing or non bearing.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The enum value is not invalid for StructuralWallUsage. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace